// https://programmers.co.kr/learn/courses/30/lessons/43165
// DFS/BFS, Level 2

// 문제 설명: 
// n개의 음이 아닌 정수가 있습니다. 이 수를 적절히 더하거나 빼서 타겟 넘버를 만들려고 합니다. 
// 예를 들어 [1, 1, 1, 1, 1]로 숫자 3을 만들려면 다음 다섯 방법을 쓸 수 있습니다.
// -1+1+1+1+1 = 3
// +1-1+1+1+1 = 3
// +1+1-1+1+1 = 3
// +1+1+1-1+1 = 3
// +1+1+1+1-1 = 3
// 사용할 수 있는 숫자가 담긴 배열 numbers, 타겟 넘버 target이 매개변수로 주어질 때 
// 숫자를 적절히 더하고 빼서 타겟 넘버를 만드는 방법의 수를 return 하도록 solution 함수를 작성해주세요.

function solution(numbers, target) {

}

/*

- 이해
n개의 음이 아닌 정수를 더하거나 빼서 원하는 숫자를 만든다.
문제의 카테고리가 어떻게 풀 지를 이미 알려주고 있는데 어떻게 이용해야 할지 감이 오지 않는다.

- 계획
numbers를 순회한다.


- 실행

- 회고

*/